import os
from dotenv import load_dotenv

from aiogram import Router, F
from aiogram.types import Message, FSInputFile

import app.keyboards as kb

program_training_router = Router()


# Бесплатная программа тренировок
@program_training_router.message(F.text == "💪 Готовые тренировки")
async def free_program_training(message: Message):
    await message.answer("""
Супер! Ваша бесплатная программа тренировок уже ждёт. Она универсальна, и вы сможете её настроить.

Однако! Если вы хотите получить программу, которая будет учитывать ваш пол, возраст, доступный инвентарь, цели и состояние здоровья — пройдите быстрый опрос. Мы literally подстроим её под вас, и вам не придётся гадать, что делать.

Потратить 2 минуты сейчас, чтобы получить идеальную программу?
""", reply_markup=kb.free_programs_kb)
    

# Отправляем пользователю файл с бесплатной программой тренировок
@program_training_router.message(F.text == "Нет, в следующий раз")
async def post_free_program(message: Message):
    await message.answer("""
Хорошо, держи файл с универсальной программой тренировок для всех! 🏋️‍♀️

В нём есть отличная база, с которой можно начать.

А если захочешь программу, которая будет учитывать твои цели, твой уровень, твой график и здоровье — просто напиши мне, и мы сделаем её персональной под тебя.

Удачи на тренировках! 
""")

    load_dotenv()
    FREE_PROGRAM=os.getenv("FREE_PROGRAM")
    file_path = FREE_PROGRAM

    # Нужно отправлять файл в бинарном виде, т.к. Aiogram требует файл как BufferedReader
    file = FSInputFile(file_path)
    await message.reply_document(file)